20210904124352-workflow.org
:PROPERTIES:
:ID:       fad0d446-fe06-4614-af63-a0c5ecc11c9c
:END:
#+title: workflow
#+filetags: :Habit:
* 概要
[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]の[[id:7e85e3f3-a6b9-447e-9826-307a3618dac8][org-mode]]を使ってタスク管理している。

流れをまとめる。

- 朝、org-agenda(~C-c a~)を見てタスクを確認する
- 今日やることを決める
- 今日で終わらないものは子タスクを作成する
  - 一段下の見出しを作り今日のDEADLINEをつける(~C-c .~)
  - 取り組むときにタイマーをオンにする(~C-c C-x i~)。ネット回線を切断する
- 取り組む
- 週に一度振り返る

今日できる、小さな目標を立てることが重要である(今日は10ページ進めるぞ)。
達成感を得られる。確かに進んでいる感がする。
あとどれくらい残っているか、どの位置にいるかを把握せず長期間何かやることはむずかしい。

自分がどれだけの分量をこなせるかを知っていれば、パフォーマンスの指標にできる。
何か変えてみるときにも、本当によい変更かわかりやすくなる。
* RepeatTasks
定期タスク。書いただけでは忘れるので、具体的な時刻を書いて通知させる。
