20210904124352-workflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-11-04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>workflow</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">workflow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeb3f3e8">概要</a></li>
<li><a href="#org522110f">RepeatTasks</a>
<ul>
<li><a href="#org2c4b383"><span class="todo TODO">TODO</span> Set today&rsquo;s goal</a></li>
<li><a href="#orgf5b06c6"><span class="todo TODO">TODO</span> Workout</a></li>
<li><a href="#orgf017009"><span class="todo TODO">TODO</span> Move entry</a></li>
<li><a href="#orgb837a47"><span class="todo TODO">TODO</span> OSS contribute</a></li>
<li><a href="#org0c44062"><span class="todo TODO">TODO</span> 資源ゴミ出し</a></li>
<li><a href="#org3e4b050"><span class="todo TODO">TODO</span> 片付け</a></li>
<li><a href="#org44d54be"><span class="todo TODO">TODO</span> Read Code</a></li>
<li><a href="#org3f9bcf1"><span class="todo TODO">TODO</span> Read Feed</a></li>
</ul>
</li>
<li><a href="#org8b14eee"><span class="todo TODO">TODO</span> Monthly plan &amp; review</a>
<ul>
<li><a href="#org24e9a0e">template</a>
<ul>
<li><a href="#org9bea055">Goal</a></li>
<li><a href="#org82dfca8">Review</a></li>
</ul>
</li>
<li><a href="#orge4f7702">2022-10</a>
<ul>
<li><a href="#org86603d8">Goal</a></li>
<li><a href="#org6c7cb4e">Review</a></li>
</ul>
</li>
<li><a href="#orgf9e2c1f">2022-09</a>
<ul>
<li><a href="#org9c5e0f6">Goal</a></li>
<li><a href="#orge2e0108">Review</a></li>
</ul>
</li>
<li><a href="#org6549fe7">2022-08</a>
<ul>
<li><a href="#org5447733">Goal</a></li>
<li><a href="#org3491f45">Review</a></li>
</ul>
</li>
<li><a href="#orgeef4de2">2022-07</a>
<ul>
<li><a href="#org36f9dd7">Review</a></li>
</ul>
</li>
<li><a href="#org029a005">2022-04</a>
<ul>
<li><a href="#org68263a6">Goal</a></li>
<li><a href="#org1c5d36e">Review</a></li>
</ul>
</li>
<li><a href="#org25b24d6">2022-03</a>
<ul>
<li><a href="#orgc4c3733">Goal<code>[33%]</code></a></li>
<li><a href="#org0f62d07">Review</a></li>
</ul>
</li>
<li><a href="#orgc18fa34">2022-02</a>
<ul>
<li><a href="#orgf33cbd9">Goal<code>[60%]</code></a></li>
<li><a href="#org38ab195">Review</a></li>
</ul>
</li>
<li><a href="#orgec7d8bd">2022-01</a>
<ul>
<li><a href="#org0821cd9">Goal <code>[80%]</code></a></li>
<li><a href="#orge4760f4">Review</a></li>
</ul>
</li>
<li><a href="#orgb7f05e1">2021-12</a>
<ul>
<li><a href="#orge4a2bf8">Review</a></li>
</ul>
</li>
<li><a href="#org5066d46">2021-11</a>
<ul>
<li><a href="#org2ae2ff1">Goal</a></li>
<li><a href="#orgb18514c">Review</a></li>
</ul>
</li>
<li><a href="#org794f1d2">2021-10</a>
<ul>
<li><a href="#org614b2f3">Goal</a></li>
<li><a href="#org5666770">Review</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge8acf74">Memo</a>
<ul>
<li><a href="#orge27474c">時間で決めず、今日やる分量を決める</a></li>
<li><a href="#org84fd630">集中するためにオフラインにする</a></li>
</ul>
</li>
<li><a href="#orgcca3b5c">Tasks</a></li>
<li><a href="#org8d12348">Archives</a>
<ul>
<li><a href="#org12bb8b2"><span class="done DONE">DONE</span> タスク状況をレポート化する</a></li>
<li><a href="#org946d596"><span class="done DONE">DONE</span> よく使うagenda viewを一発で開けるようにする</a></li>
<li><a href="#org9166694"><span class="done CLOSE">CLOSE</span> チェック忘れるとalertされなくなる</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb3f3e8" class="outline-2">
<h2 id="orgeb3f3e8"><a href="#orgeb3f3e8">概要</a></h2>
<div class="outline-text-2" id="text-orgeb3f3e8">
<p>
<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>の<a href="20210907012153-org_mode.html#ID-7e85e3f3-a6b9-447e-9826-307a3618dac8">org-mode</a>を使ってタスク管理している。
</p>

<p>
流れをまとめる。
</p>

<ul class="org-ul">
<li>朝、org-agenda(<code>C-c a</code>)を見てタスクを確認する</li>
<li>今日やることを決める</li>
<li>今日で終わらないものは子タスクを作成する
<ul class="org-ul">
<li>一段下の見出しを作り今日のDEADLINEをつける(<code>C-c .</code>)</li>
<li>取り組むときにタイマーをオンにする(<code>C-c C-x i</code>)。ネット回線を切断する</li>
</ul></li>
<li>取り組む</li>
<li>週に一度振り返る</li>
</ul>

<p>
今日できる、小さな目標を立てることが重要である(今日は10ページ進めるぞ)。
達成感を得られる。確かに進んでいる感がする。
あとどれくらい残っているか、どの位置にいるかを把握せず長期間何かやることはむずかしい。
</p>

<p>
自分がどれだけの分量をこなせるかを知っていれば、パフォーマンスの指標にできる。
何か変えてみるときにも、本当によい変更かわかりやすくなる。
</p>
</div>
</div>
<div id="outline-container-org522110f" class="outline-2">
<h2 id="org522110f"><a href="#org522110f">RepeatTasks</a></h2>
<div class="outline-text-2" id="text-org522110f">
<p>
定期タスク。書いただけでは忘れるので、具体的な時刻を書いて通知させる。
</p>
</div>
