20210904124352-workflow.org
** TODO Set today's goal
SCHEDULED: <2022-11-05 Sat 10:00 +1d>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2022-11-04 Fri 00:47]
:END:

- State "DONE"       from "TODO"       [2022-11-04 Fri 00:47]
- State "DONE"       from "TODO"       [2022-11-03 Thu 11:16]
- State "DONE"       from "TODO"       [2022-11-03 Thu 11:16]
- State "DONE"       from "TODO"       [2022-11-03 Thu 11:16]
- State "DONE"       from "TODO"       [2022-10-31 Mon 11:32]
- State "DONE"       from "TODO"       [2022-10-30 Sun 10:25]
- State "DONE"       from "TODO"       [2022-10-29 Sat 08:27]
- State "DONE"       from "TODO"       [2022-10-28 Fri 09:53]
- State "DONE"       from "TODO"       [2022-10-27 Thu 09:44]
- State "DONE"       from "TODO"       [2022-10-26 Wed 01:04]
- State "DONE"       from "TODO"       [2022-10-25 Tue 21:40]
- State "DONE"       from "TODO"       [2022-10-24 Mon 14:07]
- State "DONE"       from "TODO"       [2022-10-23 Sun 12:56]
- State "DONE"       from "TODO"       [2022-10-22 Sat 10:50]
- State "DONE"       from "TODO"       [2022-10-21 Fri 12:04]
- State "DONE"       from "TODO"       [2022-10-20 Thu 09:36]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:44]
- State "DONE"       from "TODO"       [2022-10-18 Tue 10:47]
- State "DONE"       from "TODO"       [2022-10-17 Mon 09:51]
- State "DONE"       from "TODO"       [2022-10-16 Sun 09:48]
- State "DONE"       from "TODO"       [2022-10-15 Sat 11:07]
- State "DONE"       from "TODO"       [2022-10-14 Fri 10:12]
- State "DONE"       from "TODO"       [2022-10-13 Thu 15:21]
- State "DONE"       from "TODO"       [2022-10-12 Wed 09:16]
- State "DONE"       from "TODO"       [2022-10-11 Tue 09:44]
- State "DONE"       from "TODO"       [2022-10-10 Mon 17:44]
- State "DONE"       from "TODO"       [2022-10-09 Sun 15:35]
- State "DONE"       from "TODO"       [2022-10-09 Sun 15:35]
- State "DONE"       from "TODO"       [2022-10-09 Sun 13:07]
- State "DONE"       from "TODO"       [2022-10-06 Thu 09:41]
- State "DONE"       from "TODO"       [2022-10-05 Wed 09:01]
- State "DONE"       from "TODO"       [2022-10-04 Tue 09:47]
- State "DONE"       from "TODO"       [2022-10-03 Mon 09:13]
- State "DONE"       from "TODO"       [2022-10-02 Sun 00:07]
- State "DONE"       from "TODO"       [2022-10-01 Sat 09:26]
- State "DONE"       from "TODO"       [2022-09-30 Fri 09:42]
- State "DONE"       from "TODO"       [2022-09-29 Thu 08:41]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-27 Tue 08:16]
- State "DONE"       from "TODO"       [2022-09-26 Mon 08:32]
- State "DONE"       from "TODO"       [2022-09-25 Sun 13:15]
- State "DONE"       from "TODO"       [2022-09-24 Sat 08:51]
- State "DONE"       from "TODO"       [2022-09-23 Fri 08:03]
- State "DONE"       from "TODO"       [2022-09-22 Thu 08:30]
- State "DONE"       from "TODO"       [2022-09-21 Wed 08:59]
- State "DONE"       from "TODO"       [2022-09-20 Tue 09:12]
- State "DONE"       from "TODO"       [2022-09-19 Mon 08:17]
- State "DONE"       from "TODO"       [2022-09-18 Sun 11:37]
- State "DONE"       from "TODO"       [2022-09-17 Sat 08:47]
- State "DONE"       from "TODO"       [2022-09-16 Fri 07:42]
- State "DONE"       from "TODO"       [2022-09-15 Thu 00:32]
- State "DONE"       from "TODO"       [2022-09-14 Wed 07:07]
- State "DONE"       from "TODO"       [2022-09-13 Tue 08:13]
- State "DONE"       from "TODO"       [2022-09-12 Mon 14:35]
- State "DONE"       from "TODO"       [2022-09-11 Sun 10:02]
- State "DONE"       from "TODO"       [2022-09-10 Sat 08:54]
- State "DONE"       from "TODO"       [2022-09-09 Fri 08:50]
- State "DONE"       from "TODO"       [2022-09-08 Thu 08:52]
- State "DONE"       from "TODO"       [2022-09-07 Wed 23:00]
- State "DONE"       from "TODO"       [2022-09-06 Tue 08:03]
- State "DONE"       from "TODO"       [2022-09-05 Mon 11:46]
- State "DONE"       from "TODO"       [2022-09-04 Sun 08:22]
- State "DONE"       from "TODO"       [2022-09-03 Sat 09:17]
- State "DONE"       from "TODO"       [2022-09-02 Fri 09:00]
- State "DONE"       from "TODO"       [2022-09-01 Thu 08:54]
- State "DONE"       from "TODO"       [2022-08-31 Wed 19:02]
- State "DONE"       from "TODO"       [2022-08-30 Tue 08:24]
- State "DONE"       from "TODO"       [2022-08-29 Mon 07:53]
- State "DONE"       from "TODO"       [2022-08-28 Sun 07:30]
- State "DONE"       from "TODO"       [2022-08-27 Sat 07:51]
- State "DONE"       from "TODO"       [2022-08-26 Fri 08:00]
- State "DONE"       from "TODO"       [2022-08-25 Thu 07:29]
- State "DONE"       from "TODO"       [2022-08-24 Wed 07:14]
- State "DONE"       from "TODO"       [2022-08-23 Tue 07:28]
- State "DONE"       from "TODO"       [2022-08-22 Mon 08:09]
- State "DONE"       from "TODO"       [2022-08-21 Sun 07:18]
- State "DONE"       from "TODO"       [2022-08-20 Sat 07:12]
- State "DONE"       from "TODO"       [2022-08-19 Fri 06:29]
- State "DONE"       from "TODO"       [2022-08-18 Thu 15:55]
- State "DONE"       from "TODO"       [2022-08-17 Wed 07:12]
- State "DONE"       from "TODO"       [2022-08-16 Tue 19:39]
- State "DONE"       from "TODO"       [2022-08-16 Tue 19:39]
- State "DONE"       from "TODO"       [2022-08-16 Tue 19:30]
- State "DONE"       from "TODO"       [2022-08-14 Sun 20:32]
- State "DONE"       from "TODO"       [2022-08-12 Fri 10:12]
- State "DONE"       from "TODO"       [2022-08-11 Thu 14:09]
- State "DONE"       from "TODO"       [2022-08-10 Wed 00:46]
- State "DONE"       from "TODO"       [2022-08-09 Tue 09:13]
- State "DONE"       from "TODO"       [2022-08-08 Mon 09:56]
- State "DONE"       from "TODO"       [2022-08-07 Sun 09:37]
- State "DONE"       from "TODO"       [2022-08-06 Sat 09:43]
- State "DONE"       from "TODO"       [2022-08-05 Fri 10:47]
- State "DONE"       from "TODO"       [2022-08-04 Thu 10:32]
- State "DONE"       from "TODO"       [2022-08-04 Thu 10:32]
- State "DONE"       from "TODO"       [2022-08-02 Tue 22:35]
- State "DONE"       from "TODO"       [2022-08-01 Mon 10:24]
- State "DONE"       from "TODO"       [2022-07-31 Sun 10:57]
- State "DONE"       from "TODO"       [2022-07-30 Sat 10:23]
- State "DONE"       from "TODO"       [2022-07-29 Fri 23:55]

今日の目標を決める。SCHEDULEDに今日をセットする。月目標を確認する。
