20210904124352-workflow.org
** TODO Workout
SCHEDULED: <2022-10-30 Sun 14:00 +3d>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2022-10-29 Sat 18:15]
:END:

- State "DONE"       from "TODO"       [2022-10-29 Sat 18:15]
- State "DONE"       from "TODO"       [2022-10-25 Tue 21:41]
- State "DONE"       from "TODO"       [2022-10-22 Sat 10:24]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:45]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:45]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:44]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:44]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:44]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:44]
- State "DONE"       from "TODO"       [2022-10-19 Wed 09:44]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-20 Tue 09:12]
- State "DONE"       from "TODO"       [2022-09-17 Sat 23:24]
- State "DONE"       from "TODO"       [2022-09-06 Tue 23:44]
- State "DONE"       from "TODO"       [2022-09-04 Sun 08:22]
- State "DONE"       from "TODO"       [2022-09-02 Fri 22:23]
- State "DONE"       from "TODO"       [2022-09-01 Thu 09:05]
- State "DONE"       from "TODO"       [2022-09-01 Thu 09:05]
- State "DONE"       from "TODO"       [2022-08-22 Mon 21:36]
- State "DONE"       from "TODO"       [2022-08-20 Sat 20:12]
- State "DONE"       from "TODO"       [2022-08-16 Tue 19:30]
- State "DONE"       from "TODO"       [2022-08-16 Tue 19:30]
- State "DONE"       from "TODO"       [2022-08-10 Wed 13:10]
- State "DONE"       from "TODO"       [2022-08-07 Sun 12:03]
- State "DONE"       from "TODO"       [2022-08-04 Thu 21:24]
- State "DONE"       from "TODO"       [2022-08-01 Mon 22:57]
運動する。
** TODO Move entry
SCHEDULED: <2022-11-05 Sat 11:00 +1w>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2022-10-29 Sat 18:15]
:END:

- State "DONE"       from "TODO"       [2022-10-29 Sat 18:15]
- State "DONE"       from "TODO"       [2022-10-23 Sun 13:00]
- State "DONE"       from "TODO"       [2022-10-15 Sat 11:12]
- State "DONE"       from "TODO"       [2022-10-10 Mon 13:34]
- State "DONE"       from "TODO"       [2022-10-01 Sat 09:37]
- State "DONE"       from "TODO"       [2022-09-24 Sat 08:55]
- State "DONE"       from "TODO"       [2022-09-17 Sat 23:24]
- State "DONE"       from "TODO"       [2022-09-10 Sat 10:42]
- State "DONE"       from "TODO"       [2022-09-03 Sat 09:27]
- State "DONE"       from "TODO"       [2022-08-27 Sat 07:51]
- State "DONE"       from "TODO"       [2022-08-20 Sat 08:23]
- State "DONE"       from "TODO"       [2022-08-17 Wed 07:12]
- State "DONE"       from "TODO"       [2022-08-05 Fri 10:50]
- State "DONE"       from "TODO"       [2022-07-29 Fri 21:50]
一箇所に取ったノートを適切な場所に分類する。
- [[file:~/Dropbox/junk/diary/org-journal/todo.org][notes.org]]
** TODO OSS contribute
SCHEDULED: <2022-08-01 Mon 10:00 +1m>

月に1回はコントリビュートする。
** TODO 資源ゴミ出し
SCHEDULED: <2022-08-06 Sat 09:00 +1w>
:PROPERTIES:
:LAST_REPEAT: [2022-04-09 Sat 17:27]
:END:

段ボールを捨てる。
** TODO 片付け
SCHEDULED: <2022-11-06 Sun 14:00 +1w>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2022-10-30 Sun 10:26]
:END:
- State "DONE"       from "TODO"       [2022-10-30 Sun 10:26]
- State "DONE"       from "TODO"       [2022-10-25 Tue 21:40]
- State "DONE"       from "TODO"       [2022-10-17 Mon 09:52]
- State "DONE"       from "TODO"       [2022-09-28 Wed 08:41]
- State "DONE"       from "TODO"       [2022-09-04 Sun 15:59]
- State "DONE"       from "TODO"       [2022-09-04 Sun 15:59]
- State "DONE"       from "TODO"       [2022-08-24 Wed 07:14]
- State "DONE"       from "TODO"       [2022-08-17 Wed 07:12]
- State "DONE"       from "TODO"       [2022-08-07 Sun 16:56]
** TODO Read Code                                                   :Train:
:LOGBOOK:
CLOCK: [2022-10-26 Wed 08:54]--[2022-10-26 Wed 09:19] =>  0:25
CLOCK: [2022-10-26 Wed 08:29]--[2022-10-26 Wed 08:54] =>  0:25
CLOCK: [2022-10-26 Wed 00:07]--[2022-10-26 Wed 00:32] =>  0:25
CLOCK: [2022-08-05 Fri 16:24]--[2022-08-05 Fri 16:49] =>  0:25
CLOCK: [2022-08-01 Mon 23:04]--[2022-08-01 Mon 23:29] =>  0:25
CLOCK: [2022-07-31 Sun 21:58]--[2022-07-31 Sun 22:23] =>  0:25
CLOCK: [2022-07-31 Sun 16:21]--[2022-07-31 Sun 16:46] =>  0:25
CLOCK: [2022-07-31 Sun 14:59]--[2022-07-31 Sun 15:24] =>  0:25
CLOCK: [2022-07-31 Sun 12:36]--[2022-07-31 Sun 13:01] =>  0:25
CLOCK: [2022-07-31 Sun 12:11]--[2022-07-31 Sun 12:36] =>  0:25
:END:
