20210904124352-workflow.html
<div id="outline-container-orgf5b06c6" class="outline-3">
<h3 id="orgf5b06c6"><a href="#orgf5b06c6"><span class="todo TODO">TODO</span> Workout</a></h3>
<div class="outline-text-3" id="text-orgf5b06c6">
<ul class="org-ul">
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-29 Sat 18:15]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-25 Tue 21:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-22 Sat 10:24]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:45]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:45]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:44]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:44]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:44]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:44]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed 09:44]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed 08:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed 08:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed 08:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed 08:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed 08:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-20 Tue 09:12]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-17 Sat 23:24]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-06 Tue 23:44]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-04 Sun 08:22]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-02 Fri 22:23]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-01 Thu 09:05]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-01 Thu 09:05]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-22 Mon 21:36]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-20 Sat 20:12]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-16 Tue 19:30]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-16 Tue 19:30]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-10 Wed 13:10]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-07 Sun 12:03]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-04 Thu 21:24]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 22:57]</span></span></li>
</ul>
<p>
運動する。
</p>
</div>
</div>
<div id="outline-container-orgf017009" class="outline-3">
<h3 id="orgf017009"><a href="#orgf017009"><span class="todo TODO">TODO</span> Move entry</a></h3>
<div class="outline-text-3" id="text-orgf017009">
<ul class="org-ul">
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-29 Sat 18:15]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-23 Sun 13:00]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-15 Sat 11:12]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-10 Mon 13:34]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-01 Sat 09:37]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-24 Sat 08:55]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-17 Sat 23:24]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-10 Sat 10:42]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-03 Sat 09:27]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-27 Sat 07:51]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-20 Sat 08:23]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-17 Wed 07:12]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-05 Fri 10:50]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-07-29 Fri 21:50]</span></span></li>
</ul>
<p>
一箇所に取ったノートを適切な場所に分類する。
</p>
<ul class="org-ul">
<li><a href="file:///root/Dropbox/junk/diary/org-journal/todo.html">notes.org</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb837a47" class="outline-3">
<h3 id="orgb837a47"><a href="#orgb837a47"><span class="todo TODO">TODO</span> OSS contribute</a></h3>
<div class="outline-text-3" id="text-orgb837a47">
<p>
月に1回はコントリビュートする。
</p>
</div>
</div>
<div id="outline-container-org0c44062" class="outline-3">
<h3 id="org0c44062"><a href="#org0c44062"><span class="todo TODO">TODO</span> 資源ゴミ出し</a></h3>
<div class="outline-text-3" id="text-org0c44062">
<p>
段ボールを捨てる。
</p>
</div>
</div>
<div id="outline-container-org3e4b050" class="outline-3">
<h3 id="org3e4b050"><a href="#org3e4b050"><span class="todo TODO">TODO</span> 片付け</a></h3>
<div class="outline-text-3" id="text-org3e4b050">
<ul class="org-ul">
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-30 Sun 10:26]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-25 Tue 21:40]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-17 Mon 09:52]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed 08:41]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-04 Sun 15:59]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-04 Sun 15:59]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-24 Wed 07:14]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-17 Wed 07:12]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-07 Sun 16:56]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org44d54be" class="outline-3">
<h3 id="org44d54be"><a href="#org44d54be"><span class="todo TODO">TODO</span> Read Code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Train">Train</span></span></a></h3>
<div class="outline-text-3" id="text-org44d54be">
</div>
</div>
