20210904124352-workflow.org
** TODO Read Feed                                                   :Train:
:LOGBOOK:
CLOCK: [2022-06-08 Wed 22:17]--[2022-06-08 Wed 22:42] =>  0:25
CLOCK: [2022-06-04 Sat 17:58]--[2022-06-04 Sat 18:23] =>  0:25
CLOCK: [2022-05-29 Sun 11:42]--[2022-05-29 Sun 12:07] =>  0:25
CLOCK: [2022-05-28 Sat 11:06]--[2022-05-28 Sat 11:31] =>  0:25
CLOCK: [2022-05-28 Sat 10:40]--[2022-05-28 Sat 11:05] =>  0:25
CLOCK: [2022-05-22 Sun 12:02]--[2022-05-22 Sun 12:27] =>  0:25
CLOCK: [2022-05-21 Sat 15:01]--[2022-05-21 Sat 15:26] =>  0:25
CLOCK: [2022-05-21 Sat 12:15]--[2022-05-21 Sat 12:40] =>  0:25
CLOCK: [2022-05-20 Fri 09:38]--[2022-05-20 Fri 10:03] =>  0:25
CLOCK: [2022-05-15 Sun 13:26]--[2022-05-15 Sun 13:51] =>  0:25
CLOCK: [2022-05-14 Sat 21:34]--[2022-05-14 Sat 21:59] =>  0:25
CLOCK: [2022-05-14 Sat 21:08]--[2022-05-14 Sat 21:33] =>  0:25
CLOCK: [2022-05-11 Wed 23:28]--[2022-05-11 Wed 23:53] =>  0:25
CLOCK: [2022-05-11 Wed 10:01]--[2022-05-11 Wed 10:26] =>  0:25
CLOCK: [2022-05-06 Fri 10:12]--[2022-05-06 Fri 10:37] =>  0:25
CLOCK: [2022-05-04 Wed 15:16]--[2022-05-04 Wed 15:41] =>  0:25
CLOCK: [2022-04-30 Sat 10:02]--[2022-04-30 Sat 10:27] =>  0:25
CLOCK: [2022-04-30 Sat 09:28]--[2022-04-30 Sat 09:53] =>  0:25
CLOCK: [2022-04-28 Thu 22:07]--[2022-04-28 Thu 22:32] =>  0:25
CLOCK: [2022-04-28 Thu 21:42]--[2022-04-28 Thu 22:07] =>  0:25
CLOCK: [2022-04-27 Wed 23:17]--[2022-04-27 Wed 23:42] =>  0:25
CLOCK: [2022-04-24 Sun 19:36]--[2022-04-24 Sun 20:01] =>  0:25
:END:
* TODO Monthly plan & review
SCHEDULED: <2022-12-01 Thu 12:00 +1m>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2022-11-03 Thu 11:16]
:END:

- State "DONE"       from "TODO"       [2022-11-03 Thu 11:16]
- State "DONE"       from "TODO"       [2022-10-01 Sat 09:34]
- State "DONE"       from "TODO"       [2022-09-02 Fri 11:09]
- State "DONE"       from "TODO"       [2022-08-01 Mon 10:31]
- 月を振り返る + 目標立てる
- 何か特筆することがあれば[[id:a0f58a2a-e92d-496e-9c81-dc5401ab314f][History]]に追加する

↓を実行(C-c C-c)して見よ。
#+BEGIN: clocktable :maxlevel 3 :scope agenda :tags "" :block lastmonth :step week :stepskip0 true :fileskip0 true
#+END
** template
*** Goal
*** Review
** 2022-10
*** Goal
- [X] 自作のGoツールを1つ書く
- [X] [[id:7cacbaa3-3995-41cf-8b72-58d6e07468b1][Go]]の本を3冊やる
- [ ] [[id:a6c9c9ad-d9b1-4e13-8992-75d8590e464c][Python]]の本を2冊やる
*** Review
けっこうGoが進んだ。が、あまり理解しているとはいえないことが多い。理解の難しい、わからないところが多くある。
** 2022-09
*** Goal
- [ ] ゲームリリースの目処を立たせること。細かいことをやらず、MVPの完成に注力すること
- [X] Goの本を2冊やる
*** Review
- Goやばいってなって、ゲームは途中で作るのをやめた
- Goの本は3,4つやり、自作のコマンドも1つ作ってみた
- 後半の進捗が悪いように見える。時間をかけてたが、あまり熱中してやってないことがあった。低レイヤやライブラリ読みをやりたくなってやるのだが、長くは続かない。2,3日だけ
** 2022-08
*** Goal
- [X] ゲーム作りを進める
- [X] チュートリアル完了
- [ ] 別の本からのインポート
- [ ] 平行してrustの知識を何か本で固める
*** Review
ひたすらゲーム作ってた。チュートリアル完了。後半自作パートに入ってガンガン進んだ。不安だった技術的に実装できない、ということはなくどの問題も解決できている。が、ペースは予想より遅れている。

ほぼ一本槍で、ほかのタスクについてはできてない。Rustの新しい本はやってないし、Goの勉強もちょっとやったくらい。
** 2022-07
*** Review
- 目標立ててない
- org-agendaの設定見直し
- ゲーム作りけっこう進んだ
- rustわからないところ多い。簡単なCLIツールを作成した
** 2022-04
*** Goal
- Roguelike Tutorialを5章まで到達
*** Review
- 途中で失速した。
** 2022-03
*** Goal[33%]
- [X] [[id:b2f63c13-4b30-481c-9c95-8abe388254fd][Scala]]の最初の本を読む
  - 静的型付け、関数型、[[id:9fa3711b-a22e-4cf5-ae97-5c057083674a][Java]]VMの習熟
- [ ] ↑なにか初歩的なプログラムを1つ作ってみる
  - 解説する本や参考になる手頃なソースコードが見つからなかったため断念。先に情報がどれくらいあるか調べておかないと無駄になる
- [ ] [[id:cfd092c4-1bb2-43d3-88b1-9f647809e546][Ruby]], [[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]アップデート(業務)
  - 割り込みで中断して手を付けたのは下旬
  - 途中で別の問題が発覚して延期した
  - バッファを入れずぎりぎりに始めたのがよくない
*** Review
あまり目標を気にしてなかった。後半は[[id:ddc21510-6693-4c1e-9070-db0dd2a8160b][Rust]]の[[id:50ac66da-89f2-42dc-a746-d20b041d06ae][roguelike]]チュートリアルをやり始めた。
** 2022-02
*** Goal[60%]
- [X] RailsでGraphQLを使えるようにする。そういう記事があるのでやってみる
- [ ] Lisp on Ruby([[id:9c018eb8-23a2-4632-be01-45f8d0c08073][risp]])の実装を進める。最低限おみくじスクリプトを作れるところまで関数を実装する
- [ ] [[id:cfd092c4-1bb2-43d3-88b1-9f647809e546][Ruby]], [[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]アップデート(業務)
  - プロジェクト遅延、テスト崩壊、ブランチ移動、[[id:1658782a-d331-464b-9fd7-1f8233b8b7f8][Docker]]改革が遅れたため未達成
- [X] はじめてのLisp読み終わる
- [X] Googleエンジニアリング読み終わる
*** Review
- rispは途中でやらなくなった。
- ブランチ分割、プロジェクトの逼迫、テスト崩壊によってアップデートできなかった
- [[id:eaf6ed04-7927-4a16-ba94-fbb9f6e76166][CI]]の独自[[id:1658782a-d331-464b-9fd7-1f8233b8b7f8][Docker]]イメージ化ができたのはすごくよい
- 静的サイトのdockerビルドできるようにしたのもかなりいい。そのへんのイメージ・知見が深まった
- コードを書いたり、なにか作るプロジェクトとしてはあまり進展なかった。その分有意義なことをやってたが、コードじゃないとちょっと不安定になる気がする
- マシンを移行した。[[id:32295609-a416-4227-9aa9-47aefc42eefc][dotfiles]]はよく機能して、特に難しいことはなくクリーンな環境に移行できた
- Polybarとpomodoroを統合し、よりよく機能するようになった。
** 2022-01
*** Goal [80%]
- [X] [[id:b4f456cf-d250-4877-ac4c-4b03144392f0][Web API]]を使った開発をやる。[[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]のAPIモード。チュートリアル + 何か自分で作ってみる
- [X] [[id:b4f456cf-d250-4877-ac4c-4b03144392f0][GraphQL]]に入門する。
  - 入門はしたけど、JSフレームワークでよくわからなかった。手も動かしてない。[[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]ではどうやるのかよくわからない。だめじゃん
- [ ] Lisp読み終わる
- [X] Tipping Point読み終わる
- [X] DBリファクタ、バージョンアップ等の汎用性が高いことをやる(業務)
  - 合間に処理した
