20210904124352-workflow.html
<div id="outline-container-org3f9bcf1" class="outline-3">
<h3 id="org3f9bcf1"><a href="#org3f9bcf1"><span class="todo TODO">TODO</span> Read Feed&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Train">Train</span></span></a></h3>
<div class="outline-text-3" id="text-org3f9bcf1">
</div>
</div>
</div>
<div id="outline-container-org8b14eee" class="outline-2">
<h2 id="org8b14eee"><a href="#org8b14eee"><span class="todo TODO">TODO</span> Monthly plan &amp; review</a></h2>
<div class="outline-text-2" id="text-org8b14eee">
<ul class="org-ul">
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu 11:16]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-10-01 Sat 09:34]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-09-02 Fri 11:09]</span></span></li>
<li>State &ldquo;DONE&rdquo;       from &ldquo;TODO&rdquo;       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 10:31]</span></span></li>
<li>月を振り返る + 目標立てる</li>
<li>何か特筆することがあれば<a href="20210817003906-history.html#ID-a0f58a2a-e92d-496e-9c81-dc5401ab314f">History</a>に追加する</li>
</ul>

<p>
↓を実行(C-c C-c)して見よ。
</p>
</div>
<div id="outline-container-org24e9a0e" class="outline-3">
<h3 id="org24e9a0e"><a href="#org24e9a0e">template</a></h3>
<div class="outline-text-3" id="text-org24e9a0e">
</div>
<div id="outline-container-org9bea055" class="outline-4">
<h4 id="org9bea055"><a href="#org9bea055">Goal</a></h4>
</div>
<div id="outline-container-org82dfca8" class="outline-4">
<h4 id="org82dfca8"><a href="#org82dfca8">Review</a></h4>
</div>
</div>
<div id="outline-container-orge4f7702" class="outline-3">
<h3 id="orge4f7702"><a href="#orge4f7702">2022-10</a></h3>
<div class="outline-text-3" id="text-orge4f7702">
</div>
<div id="outline-container-org86603d8" class="outline-4">
<h4 id="org86603d8"><a href="#org86603d8">Goal</a></h4>
<div class="outline-text-4" id="text-org86603d8">
<ul class="org-ul">
<li class="on"><code>[X]</code> 自作のGoツールを1つ書く</li>
<li class="on"><code>[X]</code> <a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>の本を3冊やる</li>
<li class="off"><code>[&#xa0;]</code> <a href="20210725134208-python.html#ID-a6c9c9ad-d9b1-4e13-8992-75d8590e464c">Python</a>の本を2冊やる</li>
</ul>
</div>
</div>
<div id="outline-container-org6c7cb4e" class="outline-4">
<h4 id="org6c7cb4e"><a href="#org6c7cb4e">Review</a></h4>
<div class="outline-text-4" id="text-org6c7cb4e">
<p>
けっこうGoが進んだ。が、あまり理解しているとはいえないことが多い。理解の難しい、わからないところが多くある。
</p>
</div>
</div>
</div>
<div id="outline-container-orgf9e2c1f" class="outline-3">
<h3 id="orgf9e2c1f"><a href="#orgf9e2c1f">2022-09</a></h3>
<div class="outline-text-3" id="text-orgf9e2c1f">
</div>
<div id="outline-container-org9c5e0f6" class="outline-4">
<h4 id="org9c5e0f6"><a href="#org9c5e0f6">Goal</a></h4>
<div class="outline-text-4" id="text-org9c5e0f6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> ゲームリリースの目処を立たせること。細かいことをやらず、MVPの完成に注力すること</li>
<li class="on"><code>[X]</code> Goの本を2冊やる</li>
</ul>
</div>
</div>
<div id="outline-container-orge2e0108" class="outline-4">
<h4 id="orge2e0108"><a href="#orge2e0108">Review</a></h4>
<div class="outline-text-4" id="text-orge2e0108">
<ul class="org-ul">
<li>Goやばいってなって、ゲームは途中で作るのをやめた</li>
<li>Goの本は3,4つやり、自作のコマンドも1つ作ってみた</li>
<li>後半の進捗が悪いように見える。時間をかけてたが、あまり熱中してやってないことがあった。低レイヤやライブラリ読みをやりたくなってやるのだが、長くは続かない。2,3日だけ</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6549fe7" class="outline-3">
<h3 id="org6549fe7"><a href="#org6549fe7">2022-08</a></h3>
<div class="outline-text-3" id="text-org6549fe7">
</div>
<div id="outline-container-org5447733" class="outline-4">
<h4 id="org5447733"><a href="#org5447733">Goal</a></h4>
<div class="outline-text-4" id="text-org5447733">
<ul class="org-ul">
<li class="on"><code>[X]</code> ゲーム作りを進める</li>
<li class="on"><code>[X]</code> チュートリアル完了</li>
<li class="off"><code>[&#xa0;]</code> 別の本からのインポート</li>
<li class="off"><code>[&#xa0;]</code> 平行してrustの知識を何か本で固める</li>
</ul>
</div>
</div>
<div id="outline-container-org3491f45" class="outline-4">
<h4 id="org3491f45"><a href="#org3491f45">Review</a></h4>
<div class="outline-text-4" id="text-org3491f45">
<p>
ひたすらゲーム作ってた。チュートリアル完了。後半自作パートに入ってガンガン進んだ。不安だった技術的に実装できない、ということはなくどの問題も解決できている。が、ペースは予想より遅れている。
</p>

<p>
ほぼ一本槍で、ほかのタスクについてはできてない。Rustの新しい本はやってないし、Goの勉強もちょっとやったくらい。
</p>
</div>
</div>
</div>
<div id="outline-container-orgeef4de2" class="outline-3">
<h3 id="orgeef4de2"><a href="#orgeef4de2">2022-07</a></h3>
<div class="outline-text-3" id="text-orgeef4de2">
</div>
<div id="outline-container-org36f9dd7" class="outline-4">
<h4 id="org36f9dd7"><a href="#org36f9dd7">Review</a></h4>
<div class="outline-text-4" id="text-org36f9dd7">
<ul class="org-ul">
<li>目標立ててない</li>
<li>org-agendaの設定見直し</li>
<li>ゲーム作りけっこう進んだ</li>
<li>rustわからないところ多い。簡単なCLIツールを作成した</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org029a005" class="outline-3">
<h3 id="org029a005"><a href="#org029a005">2022-04</a></h3>
<div class="outline-text-3" id="text-org029a005">
</div>
<div id="outline-container-org68263a6" class="outline-4">
<h4 id="org68263a6"><a href="#org68263a6">Goal</a></h4>
<div class="outline-text-4" id="text-org68263a6">
<ul class="org-ul">
<li>Roguelike Tutorialを5章まで到達</li>
</ul>
</div>
</div>
<div id="outline-container-org1c5d36e" class="outline-4">
<h4 id="org1c5d36e"><a href="#org1c5d36e">Review</a></h4>
<div class="outline-text-4" id="text-org1c5d36e">
<ul class="org-ul">
<li>途中で失速した。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org25b24d6" class="outline-3">
<h3 id="org25b24d6"><a href="#org25b24d6">2022-03</a></h3>
<div class="outline-text-3" id="text-org25b24d6">
</div>
<div id="outline-container-orgc4c3733" class="outline-4">
<h4 id="orgc4c3733"><a href="#orgc4c3733">Goal<code>[33%]</code></a></h4>
<div class="outline-text-4" id="text-orgc4c3733">
<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="20220108003324-scala.html#ID-b2f63c13-4b30-481c-9c95-8abe388254fd">Scala</a>の最初の本を読む
<ul class="org-ul">
<li>静的型付け、関数型、<a href="20211007104541-java.html#ID-9fa3711b-a22e-4cf5-ae97-5c057083674a">Java</a>VMの習熟</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> ↑なにか初歩的なプログラムを1つ作ってみる
<ul class="org-ul">
<li>解説する本や参考になる手頃なソースコードが見つからなかったため断念。先に情報がどれくらいあるか調べておかないと無駄になる</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> <a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a>, <a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>アップデート(業務)
<ul class="org-ul">
<li>割り込みで中断して手を付けたのは下旬</li>
<li>途中で別の問題が発覚して延期した</li>
<li>バッファを入れずぎりぎりに始めたのがよくない</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0f62d07" class="outline-4">
<h4 id="org0f62d07"><a href="#org0f62d07">Review</a></h4>
<div class="outline-text-4" id="text-org0f62d07">
<p>
あまり目標を気にしてなかった。後半は<a href="20210901101339-rust.html#ID-ddc21510-6693-4c1e-9070-db0dd2a8160b">Rust</a>の<a href="20220319131144-roguelike.html#ID-50ac66da-89f2-42dc-a746-d20b041d06ae">roguelike</a>チュートリアルをやり始めた。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc18fa34" class="outline-3">
<h3 id="orgc18fa34"><a href="#orgc18fa34">2022-02</a></h3>
<div class="outline-text-3" id="text-orgc18fa34">
</div>
<div id="outline-container-orgf33cbd9" class="outline-4">
<h4 id="orgf33cbd9"><a href="#orgf33cbd9">Goal<code>[60%]</code></a></h4>
<div class="outline-text-4" id="text-orgf33cbd9">
<ul class="org-ul">
<li class="on"><code>[X]</code> RailsでGraphQLを使えるようにする。そういう記事があるのでやってみる</li>
<li class="off"><code>[&#xa0;]</code> Lisp on Ruby(<a href="20220129113922-risp.html#ID-9c018eb8-23a2-4632-be01-45f8d0c08073">risp</a>)の実装を進める。最低限おみくじスクリプトを作れるところまで関数を実装する</li>
<li class="off"><code>[&#xa0;]</code> <a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a>, <a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>アップデート(業務)
<ul class="org-ul">
<li>プロジェクト遅延、テスト崩壊、ブランチ移動、<a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>改革が遅れたため未達成</li>
</ul></li>
<li class="on"><code>[X]</code> はじめてのLisp読み終わる</li>
<li class="on"><code>[X]</code> Googleエンジニアリング読み終わる</li>
</ul>
</div>
</div>
<div id="outline-container-org38ab195" class="outline-4">
<h4 id="org38ab195"><a href="#org38ab195">Review</a></h4>
<div class="outline-text-4" id="text-org38ab195">
<ul class="org-ul">
<li>rispは途中でやらなくなった。</li>
<li>ブランチ分割、プロジェクトの逼迫、テスト崩壊によってアップデートできなかった</li>
<li><a href="20220212141124-ci.html#ID-eaf6ed04-7927-4a16-ba94-fbb9f6e76166">CI</a>の独自<a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>イメージ化ができたのはすごくよい</li>
<li>静的サイトのdockerビルドできるようにしたのもかなりいい。そのへんのイメージ・知見が深まった</li>
<li>コードを書いたり、なにか作るプロジェクトとしてはあまり進展なかった。その分有意義なことをやってたが、コードじゃないとちょっと不安定になる気がする</li>
<li>マシンを移行した。<a href="20210912124846-dotfiles.html#ID-32295609-a416-4227-9aa9-47aefc42eefc">dotfiles</a>はよく機能して、特に難しいことはなくクリーンな環境に移行できた</li>
<li>Polybarとpomodoroを統合し、よりよく機能するようになった。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgec7d8bd" class="outline-3">
<h3 id="orgec7d8bd"><a href="#orgec7d8bd">2022-01</a></h3>
<div class="outline-text-3" id="text-orgec7d8bd">
</div>
<div id="outline-container-org0821cd9" class="outline-4">
<h4 id="org0821cd9"><a href="#org0821cd9">Goal <code>[80%]</code></a></h4>
<div class="outline-text-4" id="text-org0821cd9">
<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="20211030122204-graphql.html#ID-b4f456cf-d250-4877-ac4c-4b03144392f0">Web API</a>を使った開発をやる。<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>のAPIモード。チュートリアル + 何か自分で作ってみる</li>
<li class="on"><code>[X]</code> <a href="20211030122204-graphql.html#ID-b4f456cf-d250-4877-ac4c-4b03144392f0">GraphQL</a>に入門する。
<ul class="org-ul">
<li>入門はしたけど、JSフレームワークでよくわからなかった。手も動かしてない。<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>ではどうやるのかよくわからない。だめじゃん</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Lisp読み終わる</li>
<li class="on"><code>[X]</code> Tipping Point読み終わる</li>
<li class="on"><code>[X]</code> DBリファクタ、バージョンアップ等の汎用性が高いことをやる(業務)
<ul class="org-ul">
<li>合間に処理した</li>
</ul></li>
</ul>
</div>
</div>
