20210904124352-workflow.org
*** Review
達成率は良好。
APIモードの本が初心者向けすぎて拍子抜けだった。別のもやらないといけない。
- org-alertめちゃくちゃ良い。ちゃんと確認してた。立てた目標は追跡しないと意味がない
- とはいえ、あまり達成感はない。もうちょっと攻めてもよかった
- 目標以外でやったこと
  - インフラ
  - Lisp on Ruby
  - [[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]とpolybarの連携
** 2021-12
*** Review
- 目標は立ててない
- org-alertが最高。はじめて軌道にのっている。何か定期的にやりたければ、リマインダーまでセットでやらないといけない
- いくつかの面談で知見を得た。とくに今後のキャリア観、タスク選び、バックエンド技術獲得の方向性
- PR漁りで安全なデータベースリファクタリングに関する知見を得た
- roamグラフ出力にほれぼれする
- lispとtipping pointがやりかけ
** 2021-11
*** Goal
- [[id:ed146d63-0e55-4008-98e8-2a2f1f7329b5][Novel Game]]を完成。
*** Review
ノベルゲームは途中でほっぽり出して、[[id:cfd092c4-1bb2-43d3-88b1-9f647809e546][Ruby]]のMastering Ruby Closureを読んだ。
クロージャ面白いってなって、[[id:353d28c5-f878-4af8-81ff-95bfe4a630f5][gemat]]作りに熱中していた。
毎日やって一気に完成させた。

目標はどっかいったけど、ほかにいいものが見つかって熱中してたので悪くはない。
** 2021-10
*** Goal
*** Review
[[id:c4c3816f-e03f-41a8-9a97-ddcfd3d738ff][Haskell]]/[[id:6218deb2-43df-473a-8cdf-910c47edd801][Clojure]]/[[id:8b69b8d4-1612-4dc5-8412-96b431fdd101][SQL]]/[[id:ad1527ee-63b3-4a9b-a553-10899f57c234][TypeScript]]/スライド準備とか薄くいろいろやった月。
こうやって見るとけっこう色々やってる。何冊かの本を終えた。
逆にあまり深くは学べてない。何か作るときくらいの熱狂はない。
実際のコードがないと。

Phaserの[[id:ed146d63-0e55-4008-98e8-2a2f1f7329b5][Novel Game]]に着手。楽しい。
後半は毎朝これやるぞーと決めてなかった。あまり進まなかった感じがする。
* Memo
** 時間で決めず、今日やる分量を決める
〜時間やる、という目標の立て方はよくない。具体的でないからだ。なにかやるには、集中してないと意味ない。どんなにがんばっても時間が短くなるわけはないので、集中するインセンティブは生まれない。結果、だらだらやってあまり進んでない、あるいは進捗を把握してないので嫌な気分になる。長期的な予測もつけられないので、過大な目標を毎回立てて未達成になり、自信を失う。達成してない気分になり、気晴らしのときもリラックスできない。生活のバランスを失う。

今日やることを明確に決めておくと、集中するインセンティブが生まれ、細かく達成してモチベーションを得やすい。自分がどれくらいの量を処理できるのかがだいたい把握できてくる。長期的にもどれくらい進むか予測可能になり、大きなことを成し遂げる可能性が高くなる。
** 集中するためにオフラインにする
ポールグレアムのエッセイで紹介されてたこと。
[[http://blog.livedoor.jp/lionfan/archives/52681996.html][らいおんの隠れ家 : ポール・グレアム「気晴らしを断ち切る」 - livedoor Blog（ブログ）]]

- インターネットがない時代のパソコンでは、集中力が保てた。今は違う。
- ネットにつながってればなんだってできる。

なので、仕事用のPCではオフラインへするようにしているという。
インターネットを使う必要があるときは、離れたところにあるもう1つのPCを使ってやる。

これを参考に、LANのスイッチを買ってやってみた(机が2つないので)。かなりいい。
ふとしたときにネット検索しようとして脱線したり音楽を聞いて集中力が削がれていることがよくわかる。
インターネットにつながってないことで、心が平穏になる。

ただ生産的で知る必要があることもわからなくなる↓。

- ソフトウェアのドキュメント
- よく検索するちょっとしたこと

これらは、ローカルにあらかじめ置いて参照できるようにしておくとよさそう。
* Tasks
* Archives
** DONE タスク状況をレポート化する
CLOSED: [2021-09-12 Sun 18:18]
:LOGBOOK:
CLOCK: [2021-09-12 Sun 15:32]--[2021-09-12 Sun 15:57] =>  0:25
CLOCK: [2021-09-12 Sun 14:47]--[2021-09-12 Sun 15:12] =>  0:25
CLOCK: [2021-09-12 Sun 13:51]--[2021-09-12 Sun 14:16] =>  0:25
:END:
週ごとで作成できると面白そう。
今週doneしたやつ、タスクでかかった時間の総計。
** DONE よく使うagenda viewを一発で開けるようにする
CLOSED: [2021-09-12 Sun 18:19]
- [[https://orgmode.org/manual/Exporting-Agenda-Views.html][Exporting Agenda Views (The Org Manual)]]

week, log-modeを自動的に選択してほしい。
** CLOSE チェック忘れるとalertされなくなる
CLOSED: [2022-02-13 Sun 01:44]
何時間かはスヌーズ的にorg-alert通知してくれるが、しばらくすると出なくなる。
一応org-agendaには過ぎてるのも表示されるので放置するようなことはないが、不便。

org-agendaに期限切れが表示されるから、この問題は起きない。
