20210904124352-workflow.html
<div id="outline-container-orge4760f4" class="outline-4">
<h4 id="orge4760f4"><a href="#orge4760f4">Review</a></h4>
<div class="outline-text-4" id="text-orge4760f4">
<p>
達成率は良好。
APIモードの本が初心者向けすぎて拍子抜けだった。別のもやらないといけない。
</p>
<ul class="org-ul">
<li>org-alertめちゃくちゃ良い。ちゃんと確認してた。立てた目標は追跡しないと意味がない</li>
<li>とはいえ、あまり達成感はない。もうちょっと攻めてもよかった</li>
<li>目標以外でやったこと
<ul class="org-ul">
<li>インフラ</li>
<li>Lisp on Ruby</li>
<li><a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>とpolybarの連携</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb7f05e1" class="outline-3">
<h3 id="orgb7f05e1"><a href="#orgb7f05e1">2021-12</a></h3>
<div class="outline-text-3" id="text-orgb7f05e1">
</div>
<div id="outline-container-orge4a2bf8" class="outline-4">
<h4 id="orge4a2bf8"><a href="#orge4a2bf8">Review</a></h4>
<div class="outline-text-4" id="text-orge4a2bf8">
<ul class="org-ul">
<li>目標は立ててない</li>
<li>org-alertが最高。はじめて軌道にのっている。何か定期的にやりたければ、リマインダーまでセットでやらないといけない</li>
<li>いくつかの面談で知見を得た。とくに今後のキャリア観、タスク選び、バックエンド技術獲得の方向性</li>
<li>PR漁りで安全なデータベースリファクタリングに関する知見を得た</li>
<li>roamグラフ出力にほれぼれする</li>
<li>lispとtipping pointがやりかけ</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5066d46" class="outline-3">
<h3 id="org5066d46"><a href="#org5066d46">2021-11</a></h3>
<div class="outline-text-3" id="text-org5066d46">
</div>
<div id="outline-container-org2ae2ff1" class="outline-4">
<h4 id="org2ae2ff1"><a href="#org2ae2ff1">Goal</a></h4>
<div class="outline-text-4" id="text-org2ae2ff1">
<ul class="org-ul">
<li><a href="20211024115759-novel_game.html#ID-ed146d63-0e55-4008-98e8-2a2f1f7329b5">Novel Game</a>を完成。</li>
</ul>
</div>
</div>
<div id="outline-container-orgb18514c" class="outline-4">
<h4 id="orgb18514c"><a href="#orgb18514c">Review</a></h4>
<div class="outline-text-4" id="text-orgb18514c">
<p>
ノベルゲームは途中でほっぽり出して、<a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a>のMastering Ruby Closureを読んだ。
クロージャ面白いってなって、<a href="20211127104120-gemat.html#ID-353d28c5-f878-4af8-81ff-95bfe4a630f5">gemat</a>作りに熱中していた。
毎日やって一気に完成させた。
</p>

<p>
目標はどっかいったけど、ほかにいいものが見つかって熱中してたので悪くはない。
</p>
</div>
</div>
</div>
<div id="outline-container-org794f1d2" class="outline-3">
<h3 id="org794f1d2"><a href="#org794f1d2">2021-10</a></h3>
<div class="outline-text-3" id="text-org794f1d2">
</div>
<div id="outline-container-org614b2f3" class="outline-4">
<h4 id="org614b2f3"><a href="#org614b2f3">Goal</a></h4>
</div>
<div id="outline-container-org5666770" class="outline-4">
<h4 id="org5666770"><a href="#org5666770">Review</a></h4>
<div class="outline-text-4" id="text-org5666770">
<p>
<a href="20210907223510-haskell.html#ID-c4c3816f-e03f-41a8-9a97-ddcfd3d738ff">Haskell</a>/<a href="20210926143813-clojure.html#ID-6218deb2-43df-473a-8cdf-910c47edd801">Clojure</a>/<a href="20210725100835-sql.html#ID-8b69b8d4-1612-4dc5-8412-96b431fdd101">SQL</a>/<a href="20210831232330-typescript.html#ID-ad1527ee-63b3-4a9b-a553-10899f57c234">TypeScript</a>/スライド準備とか薄くいろいろやった月。
こうやって見るとけっこう色々やってる。何冊かの本を終えた。
逆にあまり深くは学べてない。何か作るときくらいの熱狂はない。
実際のコードがないと。
</p>

<p>
Phaserの<a href="20211024115759-novel_game.html#ID-ed146d63-0e55-4008-98e8-2a2f1f7329b5">Novel Game</a>に着手。楽しい。
後半は毎朝これやるぞーと決めてなかった。あまり進まなかった感じがする。
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orge8acf74" class="outline-2">
<h2 id="orge8acf74"><a href="#orge8acf74">Memo</a></h2>
<div class="outline-text-2" id="text-orge8acf74">
</div>
<div id="outline-container-orge27474c" class="outline-3">
<h3 id="orge27474c"><a href="#orge27474c">時間で決めず、今日やる分量を決める</a></h3>
<div class="outline-text-3" id="text-orge27474c">
<p>
〜時間やる、という目標の立て方はよくない。具体的でないからだ。なにかやるには、集中してないと意味ない。どんなにがんばっても時間が短くなるわけはないので、集中するインセンティブは生まれない。結果、だらだらやってあまり進んでない、あるいは進捗を把握してないので嫌な気分になる。長期的な予測もつけられないので、過大な目標を毎回立てて未達成になり、自信を失う。達成してない気分になり、気晴らしのときもリラックスできない。生活のバランスを失う。
</p>

<p>
今日やることを明確に決めておくと、集中するインセンティブが生まれ、細かく達成してモチベーションを得やすい。自分がどれくらいの量を処理できるのかがだいたい把握できてくる。長期的にもどれくらい進むか予測可能になり、大きなことを成し遂げる可能性が高くなる。
</p>
</div>
</div>
<div id="outline-container-org84fd630" class="outline-3">
<h3 id="org84fd630"><a href="#org84fd630">集中するためにオフラインにする</a></h3>
<div class="outline-text-3" id="text-org84fd630">
<p>
ポールグレアムのエッセイで紹介されてたこと。
<a href="http://blog.livedoor.jp/lionfan/archives/52681996.html">らいおんの隠れ家 : ポール・グレアム「気晴らしを断ち切る」 - livedoor Blog（ブログ）</a>
</p>

<ul class="org-ul">
<li>インターネットがない時代のパソコンでは、集中力が保てた。今は違う。</li>
<li>ネットにつながってればなんだってできる。</li>
</ul>

<p>
なので、仕事用のPCではオフラインへするようにしているという。
インターネットを使う必要があるときは、離れたところにあるもう1つのPCを使ってやる。
</p>

<p>
これを参考に、LANのスイッチを買ってやってみた(机が2つないので)。かなりいい。
ふとしたときにネット検索しようとして脱線したり音楽を聞いて集中力が削がれていることがよくわかる。
インターネットにつながってないことで、心が平穏になる。
</p>

<p>
ただ生産的で知る必要があることもわからなくなる↓。
</p>

<ul class="org-ul">
<li>ソフトウェアのドキュメント</li>
<li>よく検索するちょっとしたこと</li>
</ul>

<p>
これらは、ローカルにあらかじめ置いて参照できるようにしておくとよさそう。
</p>
</div>
</div>
</div>
<div id="outline-container-orgcca3b5c" class="outline-2">
<h2 id="orgcca3b5c"><a href="#orgcca3b5c">Tasks</a></h2>
</div>
<div id="outline-container-org8d12348" class="outline-2">
<h2 id="org8d12348"><a href="#org8d12348">Archives</a></h2>
<div class="outline-text-2" id="text-org8d12348">
</div>
<div id="outline-container-org12bb8b2" class="outline-3">
<h3 id="org12bb8b2"><a href="#org12bb8b2"><span class="done DONE">DONE</span> タスク状況をレポート化する</a></h3>
<div class="outline-text-3" id="text-org12bb8b2">
<p>
週ごとで作成できると面白そう。
今週doneしたやつ、タスクでかかった時間の総計。
</p>
</div>
</div>
<div id="outline-container-org946d596" class="outline-3">
<h3 id="org946d596"><a href="#org946d596"><span class="done DONE">DONE</span> よく使うagenda viewを一発で開けるようにする</a></h3>
<div class="outline-text-3" id="text-org946d596">
<ul class="org-ul">
<li><a href="https://orgmode.org/manual/Exporting-Agenda-Views.html">Exporting Agenda Views (The Org Manual)</a></li>
</ul>

<p>
week, log-modeを自動的に選択してほしい。
</p>
</div>
</div>
<div id="outline-container-org9166694" class="outline-3">
<h3 id="org9166694"><a href="#org9166694"><span class="done CLOSE">CLOSE</span> チェック忘れるとalertされなくなる</a></h3>
<div class="outline-text-3" id="text-org9166694">
<p>
何時間かはスヌーズ的にorg-alert通知してくれるが、しばらくすると出なくなる。
一応org-agendaには過ぎてるのも表示されるので放置するようなことはないが、不便。
</p>

<p>
org-agendaに期限切れが表示されるから、この問題は起きない。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
